#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/SundayOrg1-12-2025/learn-terraform-github-actions/runs/run-mTSPohQTEHFGnnyW

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.MyLinuxBox: Refreshing state... [id=fca430beb5b30e62ec7dde30902b84f66e93b2fb]
data.tls_public_key.MyLinuxBox: Refreshing...
data.tls_public_key.MyLinuxBox: Refresh complete after 0s [id=fca430beb5b30e62ec7dde30902b84f66e93b2fb]
data.aws_acm_certificate.cert: Refreshing...
data.aws_route53_zone.main: Refreshing...
aws_eip.nat: Refreshing state... [id=eipalloc-09421d013022642d9]
aws_vpc.NCal: Refreshing state... [id=vpc-012f4611dc31fb34b]
data.aws_route53_zone.main: Refresh complete after 0s [id=Z051378212GJSSE72R4FJ]
data.aws_acm_certificate.cert: Refresh complete after 1s [id=arn:aws:acm:us-west-1:273354628838:certificate/c7c41634-17f8-4e97-ba0b-456ec1cf660d]
aws_subnet.public-us-west-1c: Refreshing state... [id=subnet-0a25715e77db3a8be]
aws_subnet.private-us-west-1c: Refreshing state... [id=subnet-0ac4eabfe7aeb13bb]
aws_internet_gateway.igw: Refreshing state... [id=igw-0ff6b19e534d014c8]
aws_subnet.public-us-west-1a: Refreshing state... [id=subnet-0b1421ac79c6de38b]
aws_security_group.NCal-sg02-LB01: Refreshing state... [id=sg-03e79bd9ebcce2d2b]
aws_subnet.private-us-west-1a: Refreshing state... [id=subnet-0df8bd1228f12ff1f]
aws_security_group.NCal-sg01-servers: Refreshing state... [id=sg-0c893abc50a0db1c8]
aws_security_group.NCal-sg03-secure-servers: Refreshing state... [id=sg-0cd77f754d6790dea]
aws_route_table.public: Refreshing state... [id=rtb-09504ff9791503cb5]
aws_launch_template.NCal_LT: Refreshing state... [id=lt-06d501af2e210f66c]
aws_launch_template.NCal_LT_443: Refreshing state... [id=lt-0cd573f9009232036]
aws_nat_gateway.nat: Refreshing state... [id=nat-0c6728d7f5650b2c5]
aws_route_table_association.public-us-west-1a: Refreshing state... [id=rtbassoc-06214aa7ccdf46cae]
aws_route_table_association.public-us-west-1c: Refreshing state... [id=rtbassoc-0b9762eac87d0d11c]
aws_route_table.private: Refreshing state... [id=rtb-0a288c3b283769055]
aws_route_table_association.private-us-west-1c: Refreshing state... [id=rtbassoc-05e6b4f542be23b76]
aws_route_table_association.private-us-west-1a: Refreshing state... [id=rtbassoc-0c17b389ab98e6bb1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.NCal_asg_attachment will be created
  + resource "aws_autoscaling_attachment" "NCal_asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.NCal_asg will be created
  + resource "aws_autoscaling_group" "NCal_asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "NCal-auto-scaling-group-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-0ac4eabfe7aeb13bb",
          + "subnet-0df8bd1228f12ff1f",
        ]
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = "lt-06d501af2e210f66c"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "NCal-instance"
        }
    }

  # aws_autoscaling_policy.NCal_scaling_policy will be created
  + resource "aws_autoscaling_policy" "NCal_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "NCal-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_lb.NCal_alb will be created
  + resource "aws_lb" "NCal_alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "NCal-load-balancer"
      + security_groups            = [
          + "sg-03e79bd9ebcce2d2b",
        ]
      + subnets                    = [
          + "subnet-0a25715e77db3a8be",
          + "subnet-0b1421ac79c6de38b",
        ]
      + tags                       = {
          + "Name"    = "NCalLoadBalancer"
          + "Owner"   = "Deuce"
          + "Project" = "Multiapp"
          + "Service" = "Multiapp"
        }
      + tags_all                   = {
          + "Name"    = "NCalLoadBalancer"
          + "Owner"   = "Deuce"
          + "Project" = "Multiapp"
          + "Service" = "Multiapp"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.NCal_tg will be created
  + resource "aws_lb_target_group" "NCal_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "NCal-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "NCalTargetGroup"
          + "Owner"   = "Deuce"
          + "Project" = "Ncal1"
          + "Service" = "NCal1"
        }
      + tags_all                           = {
          + "Name"    = "NCalTargetGroup"
          + "Owner"   = "Deuce"
          + "Project" = "Ncal1"
          + "Service" = "NCal1"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-012f4611dc31fb34b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_lb_target_group.NCal_tg_443 will be created
  + resource "aws_lb_target_group" "NCal_tg_443" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "NCaltg443"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "NCal_tg_443"
          + "Owner"   = "Deuce"
          + "Project" = "NCal2"
          + "Service" = "NCal2"
        }
      + tags_all                           = {
          + "Name"    = "NCal_tg_443"
          + "Owner"   = "Deuce"
          + "Project" = "NCal2"
          + "Service" = "NCal2"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-012f4611dc31fb34b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hrrsvseverybody.click"
      + type            = "A"
      + zone_id         = "Z051378212GJSSE72R4FJ"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_dns_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @REBEL-INX, Action: `pull_request`*